Codes/Neural Networks PyTorch/Further Steps/PINNs/PGML main/PGML main/PGML-BL/OpenFoam_Laminar/icoHeatFoam-flatPlate2/0/.svn/entries
8

dir
379
http://openfoam-extend.svn.sourceforge.net/svnroot/openfoam-extend/trunk/Core/OpenFOAM-1.4.1-dev/tutorials/conjugateHeatFoam/conjugateCavity/0
http://openfoam-extend.svn.sourceforge.net/svnroot/openfoam-extend



2007-11-30T21:02:43.446442Z
348
hjasak


svn:special svn:externals svn:needs-lock











e4e07f05-0c2f-0410-a05a-b8ba57e0c909

p
file




2007-12-27T05:50:31.000000Z
df7c30ab05349d18ed6d9d607f280569
2007-11-30T21:02:43.446442Z
348
hjasak

T
file




2007-12-27T05:50:31.000000Z
136503ee5df2cb13cb3b448d006f881b
2007-11-30T21:02:43.446442Z
348
hjasak

U
file




2007-12-27T05:50:31.000000Z
12a067a6ec3a1f735e4312597a84f126
2007-11-30T21:02:43.446442Z
348
hjasak

DT
file




2007-12-27T05:50:31.000000Z
9d7336f2a55bdd2e5f6bc4f419cd7f1e
2007-11-30T21:02:43.446442Z
348
hjasak

solid
file




2007-12-27T05:50:31.000000Z
6608adfe353eb3fad875cb39829c612e
2007-11-30T21:02:43.446442Z
348
hjasak
has-props


svn:special

