Codes/Neural Networks PyTorch/Further Steps/PINNs/PGML main/PGML main/PGML-BL/OpenFoam_Laminar/icoHeatFoam-flatPlate2/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p               ICCG 1e-06 0;
    U               BICCG 1e-05 0;

    T               BICCG 1e-07 0;

//     T+T             GaussSeidel
//                     {
//                         nResSweeps              10;

//                         tolerance               1e-5;
//                         relativeTolerance       0;
//                         maxIterations           100;
//                     };

    T+T             BiCG
                    {
                        preconditioner
                        {
                            type                Cholesky;
                        }

                        tolerance               1e-5;
                        relativeTolerance       0;
                        maxIterations           1000;
                    };
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
